#+TITLE: BATTRESEARCH
#+CREATED: [2025-01-01 Wed]
#+LAST_MODIFIED: [2025-01-01 Wed]


** Loss/temp table for bus bars
#+BEGIN_SRC python :exports both :session battcalc :results table :post header(*this*)
import numpy as np

values = {
    **material_copper,
    current: 56, # 150 / 8
    voltage: 84,
    temperature: 60,
    length: 0.12,
 }

def round_row(*row):
    return [ f"{item:.2f}" for item in row]

headers = ["mm²", "A/mm²", "Diam (mm)", "Loss (W)", "Loss (%)", "ΔT (°C)"]
rows = []
for area in np.linspace(10, 60, 6):
    vals = compute(
        { **values, area_mm2: area },
        [ current_density, diameter_mm, power_loss, power_loss_percent, delta_t ])

    rows.append(round_row(area, *vals))

# Return formatted table
[headers, *rows]
#+END_SRC
#+RESULTS:
|   mm² | A/mm² | Diam (mm) | Loss (W) | Loss (%) | ΔT (°C) |
| 10.00 |  5.60 |      3.57 |     0.73 |     0.02 |  108.77 |
| 20.00 |  2.80 |      5.05 |     0.37 |     0.01 |   38.46 |
| 30.00 |  1.87 |      6.18 |     0.24 |     0.01 |   20.93 |
| 40.00 |  1.40 |      7.14 |     0.18 |     0.00 |   13.60 |
| 50.00 |  1.12 |      7.98 |     0.15 |     0.00 |    9.73 |
| 60.00 |  0.93 |      8.74 |     0.12 |     0.00 |    7.40 |

